src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/HTTPServices/registration/Ext/Module.bsl
Функция registerUserGet(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("phone"));
	
	Если Логин =  Неопределено Или Телефон = Неопределено Тогда
		Возврат Новый HTTPСервисОтвет(400, "Не передан параметр username или phone");
	КонецЕсли;
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = Логин;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	НовыйПользовательИБ.Записать();
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
	НовыйПользователь.Наименование = Логин;

	
	НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКлиент.Наименование = Логин;
	НовыйКлиент.КонтактныйТелефон = Телефон;
	НовыйКлиент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель;
	НовыйКлиент.Родитель = Справочники.Контрагенты.Покупатель;
	НовыйКлиент.Комментарий = "Контрагент зарегистрирован через мобильное приложение.";
	НовыйКлиент.Записать();  
	
	НовыйПользователь.Покупатель = НовыйКлиент.Ссылка; 
	НовыйПользователь.Записать();
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("guid", Строка(НовыйПользователь.Ссылка.УникальныйИдентификатор()));
	ДанныеПользователя.Вставить("name", Логин);
	ДанныеПользователя.Вставить("phone", Телефон);
	ДанныеПользователя.Вставить("code", Строка(НовыйПользовательИБ.УникальныйИдентификатор));
	
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);	
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
	
	Возврат Ответ;
	 
КонецФункции
